# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Cosas Otro PC\Universidad\Noveno Semestre\Sistemas Embebidos\Proy3_1\Proy3_1.cydsn\Proy3_1.cyprj
# Date: Wed, 03 Oct 2018 21:29:17 GMT
#set_units -time ns
create_clock -name {DAC_IntClock(routed)} -period 4002.6773761713525 -waveform {0 2001.33868808568} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 13.386880856760374 -waveform {0 6.69344042838019} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyMASTER_CLK} -period 13.386880856760374 -waveform {0 6.69344042838019} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 107} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {DAC_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 299 599} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 375 749} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Cosas Otro PC\Universidad\Noveno Semestre\Sistemas Embebidos\Proy3_1\Proy3_1.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Cosas Otro PC\Universidad\Noveno Semestre\Sistemas Embebidos\Proy3_1\Proy3_1.cydsn\Proy3_1.cyprj
# Date: Wed, 03 Oct 2018 21:29:11 GMT
